#Использовать asserts

&Контроллер("/")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ТочкаМаршрута("/v2/")
Процедура Тест(Ответ, Запрос, МетодЗапроса) Экспорт	

	ПроверитьТипЗапроса(МетодЗапроса, Post());	

КонецПроцедуры

&ТочкаМаршрута("/v1/hook/")
Процедура ПодписатьсяНаСобытия(Ответ, Запрос, МетодЗапроса) 	

	ПроверитьТипЗапроса(МетодЗапроса, Post());	

КонецПроцедуры

&ТочкаМаршрута("/v1/line/appoint/start/")
Процедура НазначитьСвободногоСпециалиста(Ответ, Запрос, МетодЗапроса)

	ПроверитьТипЗапроса(МетодЗапроса, Post());	
	
КонецПроцедуры

&ТочкаМаршрута("/v1/line/appoint/spec/")
Процедура НазначитьКонкретногоСпециалиста(Ответ, Запрос, МетодЗапроса)

	ПроверитьТипЗапроса(МетодЗапроса, Post());	

КонецПроцедуры

&ТочкаМаршрута("/v1/line/drop/treatment/")
Процедура ЗакрытьОбращение(Ответ, Запрос, МетодЗапроса)
	
	ПроверитьТипЗапроса(МетодЗапроса, Post());	

КонецПроцедуры

&ТочкаМаршрута("/v1/line/send/message/")
Процедура ОтправитьСообщениеПоЛинииПоддержки(Ответ, Запрос, МетодЗапроса)
	
	ПроверитьТипЗапроса(МетодЗапроса, Post());	

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьТипЗапроса(ИсходныйТип, ОжидаемыйТип)
	Ожидаем.Что(ИсходныйТип).Равно(ОжидаемыйТип);
КонецПроцедуры

Функция Post()
	Возврат "POST";
КонецФункции	

Функция Get()
	Возврат "GET";
КонецФункции	

Функция Delete()
	Возврат "DELETE";
КонецФункции	

#КонецОбласти